Raziz1/STM32F767ZI_Driver/Src/013i2c_slave_tx_testing_it.c
/*
 * 010i2c_master_tx_testing.c
 *
 *  Created on: Sep 14, 2023
 *      Author: rahim
 */

#include <stdio.h>
#include <string.h>
#include "STM32F767ZI.h"

I2C_Handle_t I2C1Handle;
#define MY_ADDR     0x61
#define SLAVE_ADDR  0x68

// tx buffer
uint8_t Tx_buf[32] = "STM32 slave mode testing....";

void delay(void)
{
	for (uint32_t i = 0; i < 250000; i++);
}

// PB8 -> I2C1_SCL
// PB9 -> I2C1_SDA

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;
	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;

	//SCL
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_8;
	GPIO_Init(&I2CPins);

	//SDA
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_9;
	GPIO_Init(&I2CPins);
}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
    I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR; // only needed if slave mode (@see protocol reference for reserved addresses)
    I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM100K;
    I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
	GPIO_Handle_t GPIObtn;
	//GPIO button
	GPIObtn.pGPIOx = GPIOC;
	GPIObtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIObtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIObtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_HIGH;
	GPIObtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PeriClockControl(GPIOC, ENABLE);
	GPIO_Init(&GPIObtn);
}

int main(void)
{
	//Initialize user button
	GPIO_ButtonInit();

	//I2C pin inits
	I2C1_GPIOInits();

	//I2C peripheral configuration
	I2C1_Inits();

	//Enable the I2C peripheral
	I2C_PeripheralControl(I2C1, ENABLE);

    I2C_IRQInterruptConfig(IRQ_NO_I2C1_EV, ENABLE);

    // enable the I2C peripheral
    I2C_PeripheralControl(I2C1, ENABLE);

    I2C_SlaveEnableDisableCallbackEvents(I2C1, ENABLE);

    while (1);
}

void I2C2_EV_IRQHandler(void)
{
    I2C_EV_IRQHandling(&I2C1Handle);
}

void I2C2_ER_IRQHandler(void)
{
    I2C_ER_IRQHandling(&I2C1Handle);
}

uint8_t commandCode = 0;

void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEvent)
{
    static uint8_t commandCode = 0;
    static uint8_t Cnt = 0;

    if(AppEvent == I2C_EV_DATA_REQ)
    {
        // master requests some data
        if (commandCode == 0x51)
        {
            // send the length information
            I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char *)Tx_buf));
        }else if (commandCode == 0x52)
        {
            // send the content of Tx_buf
            I2C_SlaveSendData(pI2CHandle->pI2Cx, Tx_buf[Cnt++]);

        }
    }else if(AppEvent == I2C_EV_DATA_RCV)
    {
        // data waiting to be read by the slave
        commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);

    }else if(AppEvent == I2C_EV_STOP)
    {
        // master has ended I2C communication
    }else if(AppEvent == I2C_EV_NACK)
    {
        //This happens only during slave txing .
		//Master has sent the NACK. so slave should understand that master doesnt need
		//more data.
		commandCode = 0xff;
		Cnt = 0;
    }
}
